tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/rtc_regs.h
/**
 * @file    
 * @brief   Registers, Bit Masks and Bit Positions for the Real-Time Clock.
 *
 */
/* ****************************************************************************
 * Copyright (C) 2016 Maxim Integrated Products, Inc., All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a
 * copy of this software and associated documentation files (the "Software"),
 * to deal in the Software without restriction, including without limitation
 * the rights to use, copy, modify, merge, publish, distribute, sublicense,
 * and/or sell copies of the Software, and to permit persons to whom the
 * Software is furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
 * OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
 * IN NO EVENT SHALL MAXIM INTEGRATED BE LIABLE FOR ANY CLAIM, DAMAGES
 * OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 *
 * Except as contained in this notice, the name of Maxim Integrated
 * Products, Inc. shall not be used except as stated in the Maxim Integrated
 * Products, Inc. Branding Policy.
 *
 * The mere transfer of this software does not imply any licenses
 * of trade secrets, proprietary technology, copyrights, patents,
 * trademarks, maskwork rights, or any other form of intellectual
 * property whatsoever. Maxim Integrated Products, Inc. retains all
 * ownership rights.
 *
 * $Date: 2017-02-16 08:47:36 -0600 (Thu, 16 Feb 2017) $
 * $Revision: 26454 $
 *
 **************************************************************************** */

/* Define to prevent redundant inclusion */
#ifndef _MXC_RTC_REGS_H_
#define _MXC_RTC_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
    If types are not defined elsewhere (CMSIS) define them here
*/
/// @cond
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I  volatile const
#endif
#ifndef __O
#define __O  volatile
#endif
#ifndef __R
#define __R  volatile const
#endif
/// @endcond

/**
 * @ingroup     rtc
 * @defgroup    rtc_registers Registers
 * @brief       Registers, Bit Masks and Bit Positions and Field Values for the Real-Time Clock
 * @{
 */

/**
 * Structure type for the Real-Time Clock module registers allowing direct 32-bit access to each register.
 */
 typedef struct {
    __IO uint32_t ctrl;                                 /**< RTC_CTRL Register @arg RTC Timer Control                                                   */
    __IO uint32_t timer;                                /**< RTC_TIMER Register @arg RTC Timer Count Value                                              */
    __IO uint32_t comp[2];                              /**< RTC_COMP0/RTC_COMP1 Registers @arg RTC Time of Day Alarm 0/1 Compare Register              */
    __IO uint32_t flags;                                /**< RTC_FLAGS Register @arg CPU Interrupt and RTC Domain Flags                                 */
    __IO uint32_t snz_val;                              /**< RTC_SNZ_VAL Register @arg RTC Timer Alarm Snooze Value                                     */
    __IO uint32_t inten;                                /**< RTC_INTEN Register @arg Interrupt Enable Controls                                          */
    __IO uint32_t prescale;                             /**< RTC_PRESCALE Register @arg RTC Timer Prescale Setting                                      */
    __R  uint32_t rsv020;                               /**< RESERVED                                                                                   */
    __IO uint32_t prescale_mask;                        /**< RTC_PRESCALE_MASK Register @arg RTC Timer Prescale Compare Mask                            */
    __IO uint32_t trim_ctrl;                            /**< RTC_TRIM_CTRL Register @arg RTC Timer Trim Controls                                        */
    __IO uint32_t trim_value;                           /**< RTC_TRIM_VALUE Register @arg RTC Timer Trim Adjustment Interval                            */
} mxc_rtctmr_regs_t;


/**
 * @ingroup rtc_registers
 * @defgroup RTCCFG_registers RTCCFG Registers
 * Structure type for access to the RTCCFG Registers. 
 * @{
 */
typedef struct {
    __IO uint32_t nano_cntr;                            /**< RTCCFG_NANO_CNTR @arg Nano Oscillator Counter Read Register    */
    __IO uint32_t clk_ctrl;                             /**< RTCCFG_CLK_CTRL @arg RTC Clock Control Settings                */
    __R  uint32_t rsv008;                               /**< RESERVED                                                       */
    __IO uint32_t osc_ctrl;                             /**< RTCCFG_OSC_CTRL @arg RTC Oscillator Control                    */
} mxc_rtccfg_regs_t;
/**@} end of defgroup RTCCFG_registers */
/**@} end of group rtc_registers.*/

/*
   Register offsets for module RTC.
*/
/**
 * @ingroup    rtc_registers
 * @defgroup   RTC_Register_Offsets Register Offsets
 * @brief      Real-Time Clock Register Offsets from the RTC Base Peripheral Address. 
 * @{
 */
#define MXC_R_RTCTMR_OFFS_CTRL                              ((uint32_t)0x00000000UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0000</tt></b> */
#define MXC_R_RTCTMR_OFFS_TIMER                             ((uint32_t)0x00000004UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0004</tt></b> */
#define MXC_R_RTCTMR_OFFS_COMP0                             ((uint32_t)0x00000008UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0008</tt></b> */
#define MXC_R_RTCTMR_OFFS_COMP1                             ((uint32_t)0x0000000CUL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x000C</tt></b> */
#define MXC_R_RTCTMR_OFFS_FLAGS                             ((uint32_t)0x00000010UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0010</tt></b> */
#define MXC_R_RTCTMR_OFFS_SNZ_VAL                           ((uint32_t)0x00000014UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0014</tt></b> */
#define MXC_R_RTCTMR_OFFS_INTEN                             ((uint32_t)0x00000018UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0018</tt></b> */
#define MXC_R_RTCTMR_OFFS_PRESCALE                          ((uint32_t)0x0000001CUL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x001C</tt></b> */
#define MXC_R_RTCTMR_OFFS_PRESCALE_MASK                     ((uint32_t)0x00000024UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0024</tt></b> */
#define MXC_R_RTCTMR_OFFS_TRIM_CTRL                         ((uint32_t)0x00000028UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0028</tt></b> */
#define MXC_R_RTCTMR_OFFS_TRIM_VALUE                        ((uint32_t)0x0000002CUL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x002C</tt></b> */
/**@} end of group RTC_Register_Offsets */
/**
 * @ingroup    RTCCFG_registers
 * @defgroup   RTCCFG_Register_Offsets RTCCFG
 * @brief      Real-Time Clock CFG Register Offsets from the RTCCFG Base Peripheral Address. 
 * @{
 */
#define MXC_R_RTCCFG_OFFS_NANO_CNTR                         ((uint32_t)0x00000000UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0000</tt></b> */
#define MXC_R_RTCCFG_OFFS_CLK_CTRL                          ((uint32_t)0x00000004UL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x0004</tt></b> */
#define MXC_R_RTCCFG_OFFS_OSC_CTRL                          ((uint32_t)0x0000000CUL)    /**< Offset from the RTC Base Peripheral Address:<b><tt>0x000C</tt></b> */
/**@} end of group RTCCFG_Register_Offsets */

