tinygo-org/tinygo/lib/arduino-max326xx/arm/system/CMSIS/Device/Maxim/MAX3263X/Include/rtc_regs.h
/*
   Field values
*/
/**
 * @ingroup RTC_CTRL_Register
 * @defgroup rtc_snz_mode_values Snooze Enable Values
 * @{
 */
#define MXC_V_RTC_CTRL_SNOOZE_DISABLE                       ((uint32_t)(0x00000000UL))  /**< SNOOZE Mode Disable */
#define MXC_V_RTC_CTRL_SNOOZE_MODE_A                        ((uint32_t)(0x00000001UL))  /**< SNOOZE Mode A */
#define MXC_V_RTC_CTRL_SNOOZE_MODE_B                        ((uint32_t)(0x00000002UL))  /**< SNOOZE Mode B */
/**@} end of group rtc_snz_mode_values */
/**
 * @ingroup RTC_PRESCALE_Register
 * @defgroup rtc_prescale_values Prescale Values
 * @{
 */
#define MXC_V_RTC_PRESCALE_DIV_2_0                          ((uint32_t)(0x00000000UL))  /**< RTC Prescale Divide by \f$ 2^{0} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_1                          ((uint32_t)(0x00000001UL))  /**< RTC Prescale Divide by \f$ 2^{1} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_2                          ((uint32_t)(0x00000002UL))  /**< RTC Prescale Divide by \f$ 2^{2} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_3                          ((uint32_t)(0x00000003UL))  /**< RTC Prescale Divide by \f$ 2^{3} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_4                          ((uint32_t)(0x00000004UL))  /**< RTC Prescale Divide by \f$ 2^{4} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_5                          ((uint32_t)(0x00000005UL))  /**< RTC Prescale Divide by \f$ 2^{5} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_6                          ((uint32_t)(0x00000006UL))  /**< RTC Prescale Divide by \f$ 2^{6} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_7                          ((uint32_t)(0x00000007UL))  /**< RTC Prescale Divide by \f$ 2^{7} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_8                          ((uint32_t)(0x00000008UL))  /**< RTC Prescale Divide by \f$ 2^{8} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_9                          ((uint32_t)(0x00000009UL))  /**< RTC Prescale Divide by \f$ 2^{9} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_10                         ((uint32_t)(0x0000000AUL))  /**< RTC Prescale Divide by \f$ 2^{10} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_11                         ((uint32_t)(0x0000000BUL))  /**< RTC Prescale Divide by \f$ 2^{11} \f$.*/
#define MXC_V_RTC_PRESCALE_DIV_2_12                         ((uint32_t)(0x0000000CUL))  /**< RTC Prescale Divide by \f$ 2^{12} \f$.*/
/**@} end of group rtc_prescale_values*/

#ifdef __cplusplus
}
#endif

#endif   /* _MXC_RTC_REGS_H_ */

